[{"id":74,"title":"Data Analyst & Project Management Resume","resume":{"skills":[{"id":1,"name":"Data Analysis","keywords":["SQL","Python (Pandas, NumPy, Scikit-learn, Matplotlib, Seaborn)","R (ggplot2, Quanteda)","IBM SPSS Statistics","Microsoft Excel","Microsoft Access"]},{"id":2,"name":"Statistical Modeling & Machine Learning","keywords":["Python (Scikit-learn, StatsModels)","R","TensorFlow 2 (Beginner)"]},{"id":3,"name":"Data Visualization","keywords":["R (ggplot2)","Tableau","Python (Matplotlib, Seaborn)"]},{"id":4,"name":"NLP & Text Processing","keywords":["Natural Language Processing (R, Python)","Regular Expressions (Python)","spaCy","Quanteda"]},{"id":5,"name":"Other Skills","keywords":["Git Bash & GitHub","Web Scraping (Selenium, BeautifulSoup)","Command Line","Social Network Analysis (R)"]},{"id":6,"name":"Project Management","keywords":["Project Planning","Team Leadership","Task Delegation","Deadline Management","Client Communication"]},{"id":7,"name":"Communication & Interpersonal Skills","keywords":["Verbal Communication","Active Listening","Negotiation","Persuasion","Public Speaking","Public Relations","Interpersonal Skills","Teamwork","Conflict Resolution"]}],"summary":"Highly motivated and results-oriented Data Analyst with proven project management and client communication skills.  Proficient in various analytical tools and fluent in German, Turkish, Arabic, and English.  Seeking a challenging role in a dynamic and innovative environment.","projects":[],"education":[{"id":1,"gpa":null,"major":"Political Science and Public Administration","minor":null,"degree":"Bachelor of Political Science and Public Administration","institution":"Ankara University","graduation_date":"Present","relevant_courses":[]},{"id":2,"gpa":null,"major":"Political Science and Social Research","minor":null,"degree":"Political Science and Social Research","institution":"Stuttgart Universität","graduation_date":"September 2021","relevant_courses":[]},{"id":3,"gpa":null,"major":"Foreign Trade","minor":null,"degree":"Foreign Trade Education","institution":"MÜSİAD Independent Industrialists and Businessmen Association","graduation_date":"February 2019","relevant_courses":[]}],"interests":[],"languages":[{"id":1,"language":"Arabic","proficiency":"Native"},{"id":2,"language":"Turkish","proficiency":"Fluent (C1)"},{"id":3,"language":"German","proficiency":"Fluent (C1)"},{"id":4,"language":"English","proficiency":"Professional Working Proficiency (B2)"},{"id":5,"language":"Spanish","proficiency":"Basic (A1)"}],"objective":"To leverage my analytical and project management expertise to contribute to the success of a forward-thinking organization, utilizing my multilingual capabilities and diverse skillset to drive impactful results.","experience":[{"id":1,"title":"Transcriptionist","company":"Transcription Project with German, Online","end_date":"Present","location":null,"start_date":"December 2021","description":"- Listened to recordings and transcribed them accurately into text.\n- Ensured grammatical accuracy, proper punctuation, and correct spelling.\n- Completed transcriptions promptly, adhering to deadlines.\n- Corrected errors and inaccuracies efficiently.\n","technologies":[]},{"id":2,"title":"Door-to-Door Sales Representative / Team Leader","company":"Pepperminds Deutschland GmbH","end_date":"October 2021","location":"Stuttgart, Germany","start_date":"February 2021","description":"- Managed a team of sales representatives, providing guidance and support.\n- Achieved sales targets consistently, exceeding expectations in assigned territories.\n- Developed and implemented strategies to improve sales performance.\n- Trained junior promoters, ensuring adherence to company guidelines.\n- Successfully managed client relationships, building trust and rapport.\n","technologies":[]},{"id":3,"title":"Arabic/Turkish Interpreter","company":"Freelance","end_date":"Present","location":null,"start_date":"2018","description":"- Provided accurate and timely interpretation services between Turkish and Arabic.\n- Assisted students with registration procedures at universities and immigration departments.\n","technologies":[]}],"certifications":[],"personal_information":{"name":"Mahmoud Atia Ead","email":"mahmoud.atia.ead@gmail.com","phone":["+90 5050782635","+49 1779035921"],"location":{"city":null,"state":null,"address":null,"postal_code":null},"profiles":{"github":"https://github.com/MahmutAtia","website":null,"linkedin":null,"portfolio":null}},"awards_and_recognition":[]},"about":"A highly motivated and results-oriented individual with a diverse background encompassing data analysis, project management, and client communication.  My passion lies in leveraging data-driven insights to solve complex problems and contribute to organizational success.  Initially drawn to data analysis through my academic pursuits in political science and public administration, I've cultivated a strong skillset in various analytical tools, including SQL, Python (Pandas, NumPy, Scikit-learn, Matplotlib, Seaborn), R (ggplot2, Quanteda), and IBM SPSS Statistics.  My experience as a Transcriptionist honed my attention to detail and accuracy, while my role as a Door-to-Door Sales Representative and Team Leader at Pepperminds Deutschland GmbH fostered exceptional communication, client management, and leadership abilities.  Furthermore, my involvement in co-founding the Egyptian Leaders Community and participation in various academic committees demonstrates my commitment to collaborative projects and strategic planning.  I am fluent in German, Turkish, and Arabic, and possess a strong command of English.  My career goal is to utilize my analytical and project management skills within a dynamic and innovative environment, contributing to impactful solutions and continuous growth. I am eager to apply my expertise to a challenging role where I can leverage my multilingual capabilities and diverse skillset to make a significant contribution.","description":"Data Analyst with Project Management experience seeking a challenging role.","icon":"pi pi-chart-line","is_default":true,"other_docs":[{"id":"cover_letter","title":"Cover Letter","content":"Dear [Hiring Manager Name],\n\nI am writing to express my keen interest in the [Job Title] position at The Global Talent Co., as advertised on [Platform].  My diverse background in data analysis, project management, and client communication, coupled with my advanced German proficiency, aligns seamlessly with the requirements outlined in the job description.\n\nMy experience as a Transcriptionist cultivated meticulous attention to detail and accuracy – essential skills for preparing funding documentation and ensuring the precision required in back-office tasks.  My leadership role at Pepperminds Deutschland GmbH honed my abilities in client communication, project management, and team collaboration.  I successfully managed teams, met deadlines, and consistently exceeded expectations in a fast-paced environment.\n\nMy proficiency in Microsoft Office Suite and Google Workspace, combined with my analytical skills in SQL, Python, and R, further strengthens my suitability for this role.  I am confident in my ability to independently manage customer projects, ensuring timely completion and successful outcomes.\n\nI am eager to contribute my skills and experience to The Global Talent Co.'s innovative and collaborative environment.  Thank you for your time and consideration.  I have attached my resume for your review and welcome the opportunity to discuss my qualifications further.\n\nSincerely,\nMahmoud Atia Ead\n","primeicon":"pi pi-file"},{"id":"motivation_letter","title":"Motivation Letter","content":"Dear [Hiring Manager Name],\n\nMy motivation for applying to the [Job Title] position at The Global Talent Co. stems from a deep admiration for your company's commitment to innovation and its impact on the startup ecosystem.  The opportunity to contribute to such a forward-thinking organization, particularly in a role that combines my analytical skills with my project management experience, is incredibly appealing.\n\nMy background in data analysis, coupled with my proven ability to manage projects effectively and communicate clearly with clients, makes me a strong candidate.  I am confident in my ability to handle the responsibilities outlined in the job description, including preparing funding documents, managing client communication, and performing back-office tasks with precision and professionalism.\n\nThe collaborative and fast-paced nature of your work environment resonates with my own work style.  I thrive in challenging situations and am adept at multitasking and prioritizing tasks to ensure timely completion.  My advanced German language skills are a significant asset, allowing me to seamlessly integrate into your team and effectively communicate with clients and colleagues.\n\nI am excited about the prospect of joining The Global Talent Co. and contributing to your continued success.  Thank you for considering my application.\n\nSincerely,\nMahmoud Atia Ead\n","primeicon":"pi pi-envelope"}],"created_at":"2025-01-04T18:09:29.722065Z","updated_at":"2025-01-04T18:09:29.722104Z","user":9}]
